
# 1. Посчитайте сумму трех введенных чисел.

#a = int(input ('Введите число 1 - '))
#b = int(input ('Введите число 2 - '))
#c = int(input ('Введите число 3 - '))
#print (a+b+c)

# 2. Даны два целых числа: A и В. Проверить истенность высказывания: "Числа имеют одинаковую четность"

#a = int(input ('Введите число A - '))
#b = int(input ('Введите число B - '))

#if    a % 2 == b % 2:            #  Вместо вот такого выражения ((a % 2 == 0)  and (b % 2 == 0)) or((a % 2 == 1)  and (b % 2 == 1)):
#    print ('Числа имеют одинаковую четность')
#else:
#    print ('Числа разной четности!!!!')


# 3. Пользовотель воодит два числа. Выведите меньшее из них.

#a = int(input ('Введите число 1 - '))
#b = int(input ('Введите число 2 - '))
#if a>b: print('Меньшее число -', b)
#elif  a<b: print('Меньшее число -', a)
#else:
#    print('Числа равны')

# 4. Пользовотель вводит целое число. Введите Да, если число четырехзначное, нет в противном случае.

#a = (input ('Введите число - '))
#if len(a) == 4:
#    print('Yes')
#else:
#    print('No')

# ИЛИ через математику 
#a = int(input ('Введите число - '))
#if (a//1000 > 0) and (a//10000 <9): 
#    print('Yes')
#else:
#    print('No')


#5 Машина за день проезжает n  километров , ей нужно проехать путь длинной m. Сколько дней она будет ехать.

#n = int(input ('Введите число n - '))
#m = int(input ('Введите число m - '))
#print(-(m)//n*-1) 

#6 
#a = int(input ('Введите число учеников в классе А - '))
#b = int(input ('Введите число учеников в классе Б - '))
#e = int(input ('Введите число учеников в классе Е - '))
#a1 = (-(a)//2*-1)
#b1 = (-(b)//2*-1)
#e1 = (-(e)//2*-1)
#print (a1+b1+e1)

#7 Склавиатуры вводим число месяца и получаем количество денй в нем.Если число не верное , прописать Ошибку.

# a = int(input ('Введите число месяца - '))
# lis31=[1,3,5,7,8,10,12]
# list30 = [4,6,9,11]
# list28 = [2]
# if a in lis31:
#     print("Дней в месяце 31") 
# elif a in list30:
#     print("Дней в месяце 30")
# elif a in list28:
#     print ("Дней в месяце 28")
# else:
#     print ("Ошибка")

